/*************************************************************************
	> File Name: 2.cpp
	> Author: 
	> Mail: 
	> Created Time: 2018年07月31日 星期二 14时06分34秒
 ************************************************************************/


#include <stdio.h>
#define MAX_N 4000000

int main() {
    int n = 1, f[3] = {0, 1, 1}, sum = 0;
    while (f[n % 3] <= MAX_N) {
        if (f[n % 3] & 1) sum += f[n % 3];
        n++;
        f[n % 3] = f[(n + 2) % 3] + f[(n + 1) % 3];
    }    
    printf("%d\n", sum);

    return 0;
}
